       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-TAX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TAX-RATE    PIC 9(2)V99 VALUE 0.10.
       LINKAGE SECTION.
       01 LNK-AMOUNT     PIC 9(6) COMP-3.
       01 LNK-TAX        PIC 9(6) COMP-3.
       PROCEDURE DIVISION USING LNK-AMOUNT LNK-TAX.
       MAIN-LOGIC.
           COMPUTE LNK-TAX = LNK-AMOUNT * WS-TAX-RATE
           GOBACK.
