       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-JOB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT      PIC 9(6) COMP-3 VALUE 1000.
       01 WS-TAX         PIC 9(6) COMP-3 VALUE 0.
       01 WS-DISP-AMT    PIC ZZZ,ZZ9.
       01 WS-DISP-TAX    PIC ZZZ,ZZ9.
       PROCEDURE DIVISION.
       MAIN-START.
           MOVE WS-AMOUNT TO WS-DISP-AMT
           DISPLAY 'INPUT AMOUNT : ' WS-DISP-AMT
      *>   CALL CALC-TAX PROGRAM
           CALL 'CALC-TAX' USING WS-AMOUNT WS-TAX
           MOVE WS-TAX TO WS-DISP-TAX
           DISPLAY 'CALCULATED TAX: ' WS-DISP-TAX
           STOP RUN.
