*        BMS MAPSET FOR THE TODO SAMPLE APPLICATION (DEMO 009)
*        1-71 = BODY, 72 = CONTINUATION, CONTINUED OPERANDS START AT 16
TODOSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      *
               TIOAPFX=YES,EXTATT=MAPONLY,CTRL=(FREEKB,FRSET)
TODOMAP  DFHMDI SIZE=(24,80)
*        --- TITLE LINE ---
         DFHMDF POS=(1,1),LENGTH=28,ATTRB=(PROT,BRT),                  *
               COLOR=NEUTRAL,INITIAL='TODO LIST  --  cobol-on-java'
         DFHMDF POS=(1,62),LENGTH=17,ATTRB=(PROT,NORM),                *
               COLOR=BLUE,INITIAL='TRANSID: TODO'
*        --- COLUMN HEADINGS (ALIGNED WITH THE LIST LINES) ---
         DFHMDF POS=(3,1),LENGTH=78,ATTRB=(PROT,NORM),                 *
               COLOR=BLUE,INITIAL='   NO ST   TASK'
*        --- ONE WHOLE SCREEN LINE PER TODO, EIGHT TIMES (ROWS 5-12) ---
LINE     DFHMDF POS=(5,1),LENGTH=79,OCCURS=8,ATTRB=(PROT,NORM),        *
               COLOR=TURQUOISE
*        --- COMMAND LINE ---
         DFHMDF POS=(14,1),LENGTH=12,ATTRB=(PROT,NORM),                *
               COLOR=GREEN,INITIAL='COMMAND ==>'
CMD      DFHMDF POS=(14,15),LENGTH=60,ATTRB=(UNPROT,NORM,IC),          *
               COLOR=GREEN,HILIGHT=UNDERLINE
         DFHMDF POS=(14,76),LENGTH=3,ATTRB=(ASKIP,NORM)
*        --- MESSAGE AND COUNTERS WRITTEN BY THE PROGRAM ---
MSG      DFHMDF POS=(16,1),LENGTH=78,ATTRB=(PROT,BRT),COLOR=YELLOW
CNT      DFHMDF POS=(18,1),LENGTH=78,ATTRB=(PROT,NORM),COLOR=BLUE
*        --- STATIC HELP ---
         DFHMDF POS=(21,1),LENGTH=78,ATTRB=(PROT,NORM),                *
               INITIAL='ADD text | DONE n | OPEN n | DEL n | LIST'
         DFHMDF POS=(22,1),LENGTH=78,ATTRB=(PROT,NORM),                *
               INITIAL='ENTER=RUN   PF3=EXIT   CLEAR=REDISPLAY'
         DFHMSD TYPE=FINAL
         END
