 /* DEMO #010: PL/I PROGRAM BUILT BY cobol-maven-plugin */
 HELLO: PROCEDURE OPTIONS(MAIN);
   DCL N FIXED BIN(31) INIT(0);
   %INCLUDE GREETING;
   DO WHILE (N < 3);
     N = N + 1;
     PUT SKIP LIST(TRIM(GREETING), N);
   END;
 END HELLO;
