       IDENTIFICATION DIVISION.
       PROGRAM-ID. INQPROG.
       DATA DIVISION.
       LINKAGE SECTION.
       01  DFHCOMMAREA       PIC X(16).
       PROCEDURE DIVISION USING DFHCOMMAREA.
       MAIN-START.
           DISPLAY '  [CICS:INQPROG] LINK child program executing.'
           DISPLAY '  [CICS:INQPROG] Received COMMAREA: ' DFHCOMMAREA
           MOVE 'RESP=BAL:9999000' TO DFHCOMMAREA
           DISPLAY '  [CICS:INQPROG] Updated COMMAREA and GOBACK.'
           GOBACK.
